Саракташ2/src/InformationRegisters/ТоварыПоКатегориям/ТоварыПоКатегориям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТоварыПоКатегориям</name>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Категория</name>
    <type>
      <types>CatalogRef.КатегорииТоваров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Саракташ2/src/AccumulationRegisters/Взаиморасчеты/Взаиморасчеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Взаиморасчеты</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ТипЦена</types>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сделка</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Саракташ2/src/InformationRegisters/ЦеныЗакупки/ЦеныЗакупки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныЗакупки</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Строка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Саракташ2/src/Catalogs/СтатусыЗаказов/СтатусыЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтатусыЗаказов</name>
  <predefined>
    <items>
      <name>Новый</name>
      <description>Новый</description>
    </items>
    <items>
      <name>Отменен</name>
      <description>Отменен</description>
    </items>
  </predefined>
  <attributes>
    <name>IDНаСайте</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Цвет</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Шрифт</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварСписывается</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Розничный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Оптовый</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РаботаПоЗаказуЗакрыта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьЗадолженность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварРезервируется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварРезервируетсяДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьВОтчетеПоВозвратам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СборКурьерки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СборПочты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>DPD</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Саракташ2/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <predefined>
    <items>
      <name>Анонимный</name>
      <description>Анонимный</description>
    </items>
  </predefined>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидКонтрагента</name>
    <type>
      <types>EnumRef.ЮрФизЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Опт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Розница</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументУдостоверяющийЛичность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <comment>ОГРН для неиностранных контрагентов</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоСерияНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УсловияОплаты</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредпочтенияВИзделиях</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоТранспортнаяКомпания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяТранспортнаяКомпания</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойБанковскийСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоискПоТелефону</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоискПоАдресуЭлектроннойПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоискПоАдресам</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDНаСайте</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизиты</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизиты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Саракташ2/src/CommonModules/СлужебныйСервер/Module.bsl
Процедура ЗаполнениеПолейПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Источник.ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Источник.ЭтоНовый() Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитПоле = Источник.Метаданные().Реквизиты.Найти("Автор");
	Если РеквизитПоле <> Неопределено И НЕ ЗначениеЗаполнено(Источник[РеквизитПоле.Имя]) Тогда
		Источник[РеквизитПоле.Имя] = ПовторноеИспользованиеСервер.ТекущийПользователь();
	КонецЕсли; 	
	
КонецПроцедуры

Процедура ЗаписатьПринадлежностьККатегории(Номенклатура,Категория,Принадлежность) Экспорт
	
	МЗ = РегистрыСведений.ТоварыПоКатегориям.СоздатьМенеджерЗаписи();
	МЗ.Номенклатура = Номенклатура;
	МЗ.Категория = Категория;
	Если Принадлежность Тогда
		МЗ.Записать();
	Иначе
		МЗ.Удалить();
	КонецЕсли;
	
КонецПроцедуры

Процедура РаскраситьПоСтатусам(Форма,ИмяСписка,ИмяПоляСтатуса) Экспорт
			
	СписокУдаляемыхЭлементов = Новый СписокЗначений;
	Для каждого ЭлементУсловногоОформления Из Форма[ИмяСписка].КомпоновщикНастроек.Настройки.УсловноеОформление.Элементы Цикл
		Если ЭлементУсловногоОформления.ИдентификаторПользовательскойНастройки = "Предустановленный" Тогда
			СписокУдаляемыхЭлементов.Добавить(ЭлементУсловногоОформления);
		КонецЕсли;
	КонецЦикла;
	Для каждого Элемент Из СписокУдаляемыхЭлементов Цикл
		Форма[ИмяСписка].КомпоновщикНастроек.Настройки.УсловноеОформление.Элементы.Удалить(Элемент.Значение);
	КонецЦикла;
	
	ВыборкаСтатусы = Справочники.СтатусыЗаказов.Выбрать(); 	
	Пока ВыборкаСтатусы.Следующий() Цикл  	
		
		ЦветФона = ВыборкаСтатусы.Цвет.Получить();
		Шрифт = ВыборкаСтатусы.Шрифт.Получить();
		Если ТипЗнч(ЦветФона) <> Тип("Цвет") И ТипЗнч(Шрифт) <> Тип("Шрифт") Тогда
			Продолжить;
		КонецЕсли;
				
		ЭлементУсловногоОформления = Форма[ИмяСписка].КомпоновщикНастроек.Настройки.УсловноеОформление.Элементы.Добавить();    		
		ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));  		
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоляСтатуса);
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = ВыборкаСтатусы.Ссылка;
		
		Если ТипЗнч(ЦветФона) = Тип("Цвет") Тогда 
			ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветФона);
		КонецЕсли;
		Если ТипЗнч(Шрифт) = Тип("Шрифт") Тогда 
			ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Шрифт);
		КонецЕсли;
		
		ЭлементУсловногоОформления.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		ЭлементУсловногоОформления.ИдентификаторПользовательскойНастройки = "Предустановленный";
		ЭлементУсловногоОформления.Представление = "По статусу заказа " + ВыборкаСтатусы.Наименование;
		
	КонецЦикла;  	
		
КонецПроцедуры

Функция ОткрыватьФормуЗаполнения(Статус) Экспорт
	
	Возврат ?(ЗначениеЗаполнено(Статус), Статус.ОткрыватьФормуОформления,Истина); 
	
КонецФункции

Функция ПолучитьСтатусыЗакрытыхЗаказов() Экспорт
	
	Закрытые = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СтатусыЗаказов.Ссылка
	|ИЗ
	|	Справочник.СтатусыЗаказов КАК СтатусыЗаказов
	|ГДЕ
	|	НЕ СтатусыЗаказов.ПометкаУдаления
	|	И СтатусыЗаказов.РаботаПоЗаказуЗакрыта";
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаЗакрытые = РезультатЗапроса.Выбрать();
		Пока ВыборкаЗакрытые.Следующий() Цикл
			Закрытые.Вставить(ВыборкаЗакрытые.Ссылка,Истина);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Закрытые;
	
КонецФункции

Функция ЕдиИзм(Знач Номенклатура) Экспорт
	
	Возврат Номенклатура.ЕдиницаИзмерения;
	
КонецФункции

Функция ОстатокДолгаПоЗаказу(Знач Заказ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВзаиморасчетыОстатки.СуммаОстаток КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.Взаиморасчеты.Остатки(, Сделка = &Сделка) КАК ВзаиморасчетыОстатки";
	Запрос.УстановитьПараметр("Сделка", Заказ);
	Рез = Запрос.Выполнить();
	Если Не Рез.Пустой() Тогда
		Выб = Рез.Выбрать();
		Если Выб.Следующий() Тогда
			Возврат Выб.СуммаОстаток;
		КонецЕсли;
	КонецЕсли;
	Возврат 0;

КонецФункции

Функция ЦеныЗакупки(Знач Товары, Знач Контрагент, Знач Дата = Неопределено) Экспорт
	
	мСписок = Новый СписокЗначений;
	Если ТипЗнч(Товары) = Тип("СправочникСсылка.Номенклатура") Тогда
		мСписок.Добавить(Товары);
	ИначеЕсли ТипЗнч(Товары) = Тип("Массив") Тогда
		мСписок.ЗагрузитьЗначения(Товары);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЦеныЗакупкиСрезПоследних.Номенклатура КАК Номенклатура,
	|	ЦеныЗакупкиСрезПоследних.Цена КАК Цена
	|ПОМЕСТИТЬ ЦеныПоставщиков
	|ИЗ
	|	РегистрСведений.ЦеныЗакупки.СрезПоследних(
	|			&Дата,
	|			Номенклатура В (&Список)
	|				И Контрагент = &Контрагент) КАК ЦеныЗакупкиСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦеныЗакупкиСрезПоследних.Номенклатура КАК Номенклатура,
	|	ЦеныЗакупкиСрезПоследних.Цена КАК Цена
	|ПОМЕСТИТЬ ЦеныПоУмолчанию
	|ИЗ
	|	РегистрСведений.ЦеныЗакупки.СрезПоследних(
	|			&Дата,
	|			Номенклатура В (&Список)
	|				И Контрагент = &ПустойКонтрагент) КАК ЦеныЗакупкиСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ЦеныПоставщиков.Номенклатура, ЦеныПоУмолчанию.Номенклатура) КАК Номенклатура,
	|	ЕСТЬNULL(ЦеныПоставщиков.Цена, ЦеныПоУмолчанию.Цена) КАК Цена
	|ИЗ
	|	ЦеныПоставщиков КАК ЦеныПоставщиков
	|		ПОЛНОЕ СОЕДИНЕНИЕ ЦеныПоУмолчанию КАК ЦеныПоУмолчанию
	|		ПО ЦеныПоставщиков.Номенклатура = ЦеныПоУмолчанию.Номенклатура";
	Запрос.УстановитьПараметр("Список", мСписок);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ПустойКонтрагент", Справочники.Контрагенты.ПустаяСсылка());
	Запрос.УстановитьПараметр("Дата", Дата);
	
	ЦеныЗакупки = Новый Соответствие;
	Рез = Запрос.Выполнить();
	Выб = Рез.Выбрать();
	Пока Выб.Следующий() Цикл
		ЦеныЗакупки.Вставить(Выб.Номенклатура, Выб.Цена);
	КонецЦикла;
	
	Возврат ЦеныЗакупки;
	
КонецФункции

Функция ШтрихкодНоменклатуры(Знач Номенклатура) Экспорт
	
	Ид = Строка(Номенклатура.Код);
	
	Возврат Ид;
	
КонецФункции
